#include "SnakeGame.h" // เรียกใช้ header file ที่ประกาศคลาส SnakeGame และเมธอด

int main() { // ฟังก์ชันหลักของโปรแกรม เป็นจุดเริ่มต้นเมื่อโปรแกรมถูกเรียกใช้งาน
    SnakeGame game; // สร้างวัตถุชื่อ game จากคลาส SnakeGame ซึ่งจะเรียก constructor เพื่อเตรียมข้อมูลเกม เช่น ขนาดฉาก ตำแหน่งงู ผลไม้ เป็นต้น
    game.run(); ///เรียกใช้เมธอด run() ของวัตถุ game เพื่อเริ่มลูปเกมหลัก เช่น วาดฉาก รับ input อัปเดตตำแหน่งงู ตรวจชน
    return 0; ///// จบโปรแกรมด้วยรหัส 0 หมายถึงสิ้นสุดโปรแกรมโดยไม่มีข้อผิดพลาด
}
